---
kind: type
id: T:Autodesk.Revit.Exceptions.RevitServerUnauthorizedException
source: html/9e8c1efc-8719-fe01-f311-cfade7b177ed.htm
---
# Autodesk.Revit.Exceptions.RevitServerUnauthorizedException

The exception that is thrown when a call to the server is unauthorized.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class RevitServerUnauthorizedException : RevitServerException
```